# Ты думал здесь что-то будет?

# ....................:;;;+++++++++++++++++++++++xxxxxx++++;;;+++;+;;++++++++++++;:::::::::::::::::::::::::::::
# .xxxxxx+x+++x;:::x&&&&$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$&$$$$$$$$$$$$$$$$&&$$&$$$$$$$$$$$$$$$$XX$$$XXXX$X$X:
# .xxxxxxxX+X&&&&&&&&$X$$$XXXX$$$XxxxxxxxxxxxxxxxxxxXX$XXxxXXXxxxxXX$$$XXXXXXXXXXXX$$XxxxXXXxxxxXxxxxXXXX$$$$X:
# .xxxxxX+xXX.......&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&XX+XX$:
# .xxxxx++x;x&&:..&&...&XX....&$&.....................&.....&;......&&&.....&&......&&....:&.....;...XX+X$X$$$:
# .xxx+xxxXX;&&...&&..&&&&$..$&&&..++..&:.x..$...:.......&..;&..&;..&X...&...&..;x..&..::.....:.....;&&&&$XXX$:
# .xxxxxx++xx&&...&&......;..x&&&..x&..&&..:.&.......:&&....&&..&:..&&&&&...&&..;x..&:.:&&&&..&&&&:.....;&x$$X:
# .xxxxxxx;xX&&...&&..+:..X..x&&;..$+..&&....&..X..$.....&..&&..;...&&...&......$x..&...:.....x.....;;..&&$x$$:
# .xxxxxxxX&&&&...++.....XX:.x&&........&....&..:.....&........:&...&&&....&&........&:...&&&...&&.....X&&$$$$:
# .xxxxxxx+x$$&&&&&&&&&&&&&&XxX;.X&&&&..&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&..&&&;..&&&&&Xx&&&&&&&&&&&&&X$$$$:
# .xxxxxx+;+&&$$$X$$XX$XxxXXx+x$&$+;x&&&;:.:;x+xXXX$XXX$$&&&&&&&&&X$XX$&$XX$&&&&$&&&&&&&&&$&&&&&$xXXXXXXXXXX$X:
# .xxxxxxX+;$$X&$XX$&&&&&&&&&&&&$X$&&&&XxXX&&&&&&&&&&&&&$&&.....$&&&&&&&&&&&&&&&&&&&&&&&&&&&...+&&$XXXXXxxXxXX:
# .xxxxxxx++&&$$$$$&&...;........&$...&&+X&......&;...&&$&...;.$X..&..x&......&&...+&............X&XxXXXXXXX$X:
# .xxxxxxx+;x&&&&&$&&...&..&&..+&...&..&&&&&&..X&..;$..$&&..X$..x..$..&&..$..;X..&...&;..&&&&&$..$&xX$$XXXXXXX:
# .xxxxxxxx;+&&$$$X&&..:&..$&..;&:..X.......&..X&:..x..&&&..x$..&..;..&&..$..X&..:&X&&...&&......&&XXXXXXXXXXX:
# .xxxxx+x+;+$&&$$xX&......&&...&..:&..&&&&&&..;&..+x..X&&..$$..&;...+&+.X&..&&..&...&...&&;&&&&&&$xXX$$X$XXXX:
# .xxxxxxxx++X&&$&X++&&&....+...&&....$&:..;....&X....&&x&$....x&&............&x....&&...+&...+++X&X$$$$$$X$$$:
# .xxxxx+xx++x&&$&$x;:+$&&&&&&&&&&&&&&&;+x+x&&&&X&&&&&&+xX&&&&&&;.:x&&..&&&&..X&&&&&&&&&&&&&&&&$$$$&&&&&&&&&&&;
# .xxx+xxx$X+X&&&&xxxx++;;;;;;::;;;;;;+xxxx++++x++++++++x+xxxxxx$&&&x$&&&++X&&&X++XXX$X$XXxXXXX$$X$XXXXXXXX$$$:
# .xxxxxxx$X+;+$&$x++xxxxx$$X$$XXx+::::::;;+x+++++x+++xxxx+++++++;+++xx++xX+xxx+xx&$$$XXxxxXX$X$X$$$$$$$$$$$$$;
# .++xxxxxX;;:x$$X;;;xxXXXxxXX$&&&&&&&$x+;:;;;;;;;;;;;;;;;;;;;+++++xxxxxXxxxx+++xX&$XXXXXXXXX$$$$$$$$$$$XX$$$$;
# .xxxxx+x+:::x&X+xxx++xxxxx;:.....:;&&&&&&Xx+:;::;++++++++++;:::.:::.:::;++xXXxX$&$$$XxXXX$$$$$XX$$$$$$$$$$$$;
# .xxxxxx+++$&&$Xx+x++xxxx$&&&&&&&&&&$XX$$$&&&$XXX$&X+xXX$$&$&&&&&&&$$XXXx+x+++;x&&$xx$$X$X$$$$X$$$$$$$$$$$$$$;
# .x++xxx+&$X$&$xx++++xxxx++x+;;x&&$:...;+;;x$&&&$Xx+++xxxxxxxxxXX$&&&&&&&&$Xxxx&&x;x&&&&&$$$$$$$$$$$$$$$$$$$$;
# .xxxx++x$X;+XXx++x++xxxxxxxxxxxxxxXX$&&&&&&&$XXXxx++++;;x+xXXx+::....:::+xXxxX$;;x&&$$$$$$$$$X$$$$$$$$$$$$$$;
# .xxx+xx+++x$$Xx+xx+++xxxx+xxx++;;+++xxxxXXX+++++++;;;:;+xXx+X&&&&&&&&x+++;;:x&:x&&XXXXXXXX$$$$$$$$$$$$$$$$$$;
# .xxxxxx+++$&Xxx;xx+++++++++++++xxxxxXXXXx+;:;;;++++++;$&&&&$X&&....+&&&Xxxxx&X.$&&&&$$$$$$XXXXX$$$$$&&&&$$$$;
# .x++;+xx+;+XX+++xxxx++++++++xxxxxxxxxxx+xxxxxx++++++xxx++xXX$XX$&&&$x++x+++x&;&&&&&&&&&&&&&&&&&$$$$&$$$$&&&&;
# .$$&$x;;+:+Xx+x+xxxxx+++++xx+x++xx+++++++++++++xx+++++xx+xx+;;:;;:;;+x+++;;$&:;+x&&&&&&&&&&&&$&$XXX$$&$$$$$&;
# .;...:+;.:+&$xx+xx+++++++++++++++++++++++xxx++++++++++xx++xx++;+;;+xx+xxx;+&$:;;.......+X$&&&&&&&&XXX$$$$&&&+
# ..X&&&&&&&Xxx+xxxxxxxx+++++++xx++xx++++xxXXXXXxxx+x+x;;+++++++;;+++++xxxx;X&x;xxxxxx++;;:::::::+&&&&&&&&&&&&x
# $&&&&&&&&&&Xx+xxxxxxxx+x++++++x++xxXXXXXxx+++++xx+x++;;;+++x+++++++++++++;$&++x+xx+xxxxx+x++x;+;;...::;;+xx+.
# X&&&&&$&&$;xxxxxxxxxxxxx+++xxxx++xxXXXX+++;;+xxxxxXXx+++x+xXXXXXxxx+x+;+;;&$+xxx++xxx+xxxxxxxx++;+x+;::;:;;:.
# x$$$$&&&&;$$+xxx+xxxxx+xx++++++;+++xXXx+++++;++xXXxxXXx++++++x+xxxxxx+;+:$&++xxxxxxxxxxxxx+xx+xxxxxxxxxxxxxx.
# x&&&$&&&;:$&+xxxxxxx+++++++++++;;+;++++++xXx++;:...:;;+xxx+++++;;;;;;+x:;&$;xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxX.
# x&&&&$&&;:X$+xxx+xx+++++++++++++++xxxxxX&&&$x+;;;xxx+;+++++++;++++++++::&&x++x+++x+++xxxxxx++++xx+xxxxxxxxxX.
# +$X$&&&&:;$&xx+Xxx+++++++++++++++++++++++;+xx+;+xxxxxx++++++++++;+;+++:X&X+XXXXxxxxx++++++xxxxxxxxxxxxxxx+xx.
# x&$&&&&x:;+&xxxxxxx+xx+x++x+++++xxxxxxxxXXXXxxxxxxxxx+++++++++;++++++;x&X:++;++xXXXX$&$Xxx++++++++++++xxxxxX.
# x$&&$&&+:;:&&x+++Xx+xxxxx+++++xxxxxXxxxxxx+++++xxx+++x++++++++;+++xx+;$$x+xxxxx+;;+;;;+xX$$$$$XXXxxxxx++x+xX.
# x&&&&&&;;+;x&&++x++xx+++++++xx+++++xxxxx++++++xxxxXxxxx++++;;++::;+;+x$XxxXxxxxXxxxx++;;;;++xxXXXXXXXXXxx+xx.
# x$$&&&&;;x;:&&X+xxxxxx+++xxxx+++++++xxx+++++x+++++++XX++++++;++++xx+x$X++XxxxxxxXxXxX$$$Xxx+++;;++xxxX$XX$XX.
# x&&&&&&::xx++&&xxx++x++++xx++++x++:.......:::::;;;;;:;;+++++;;;+xx;;+::xxxxxxXxx++++xxxxxxXXXXXx++++;;;++xXX.
# x&&&$&&;:xxxx$&&xx++xxxx+++xxX$&&&&&&&&&$X+:.:.....:;;++++;;;;+X;..X&&:..+x+;;+X$&$Xxxxx+xx++xxX$$XXXXXx+;;;.
# x$&&&&&X:;;+;:x&&xxxx+++++x++;;+xxXXxX$&&&&&&&&&&&&xx+x+;+++++;:.+&&&&&&+.:x&&&Xx++xxxxxxxxxxxxx+++xxxXX$&&&.
# x&$&&&&&;;xxxxx$&$X++++xxx+++++++xxx+++++xXX$X+XxXXx;+++;;;;;:;:+&&&&&&&&&X..:;xX++xxx+x+xxxxxxxXXxx++++x++x.
# x$&&&&&&X:+X+++xX&&$Xx+++xxxxxxxxx+;::::..::;::::::;+;::;;;:;::$&&&$$$$&&&&&&:..+xxxxxxxxxxXxxxxxxxxxxxxxxXx.
# x$&&&&&&&+.:+x+;;x&&&&Xx;;++xxxx+xXX$$Xx++;;;;;;;;;;;:;++++::X&&&$$&&&&$$&&&&&&x.:;x++xxxxxxxxxxxxxxxxxx+;;+.
# x$$&&&&&&&X:;+xx+;+X$$Xxxxx+++++++xxX$$$&&X+;;;;;++;;:;;;:;x&&&&$&&&&$&$&&$&&&&&&X.:xxxxXxxxxxxxxXxx+;:;;+X$.
# x&&&$$&$&&&x..+xXxxx$&&&$+;;;;;++;+;;;;++xXXxx++;;;;;;++xX&&&&&$$X$$&$&&&&$$$$$$&&&X..:++xxxxXxxx;:;+X$&&&&X.
# x&&&&&&&&&&&&.::++++++X&&&$XXx++x+x++++;++xxXXXxx+++;;x$&&&&&&$&&&&&&&&&$&&&&&$&&$&&&&;.:++xx++;+x$&&&&$X$$&:
# x$&&&&&$$&&&&&;.:xXx++xX&&&XXXXXxxx+++;;++;;+x++X$$$&&&&&&&&&&$$$&&&&&&&&&&&&&&&&&&&&&&&x:.;:++X$$$$$$$XXx+X.
# x&&&&&&&&&$&&&&&;..;xXxxx$&&&&&&$$$$Xx;::::;;+xxXX&&&&&&&&&&&&&&&&x:..:x$&&$&$&&&$&$$X$&&&X+$&&&&&&$$$&&$XXX.
# x&&&&&&&&&&$$$&&&&+:::++xx+++X$&&&&&&&&X;::;;;;;;:;;+x&&&&&&&$$$&x:;;..+&&&$&$&&$$&&&&&$&&&&x..:x$&&$xxxxxxx.
# x&&&&&&&&&&&$&&&&&&&$+:::;++xXxx+xx+;;;+XXx+;;++;+;;;:x&$&&&&$&&&x+++;+X&&&$&$&&&&&$$$&&&&&&&&X.:.::x&&&&&$$.
# x&&&&&&&&&&&&&&&$&$&&&&&X+;..........+$&&&&+.::;;;;;;:;x$&&&&&&&$x++;:;X&&&$&$&$$&&$$&$&$&&&&&&&x:;x;:.:;+X&:
# x&&&&&&&&&&&$&$$&&&&&&&&&&&&&&&&&&&&&&&&$&&&&X+;:;:;+;::.:X&&&&$X++;;:.;&&&$&$$$$&&&&$&$$&$$$&&&&$:;xxxxxx+;.
# x&&&&&&$$&&&&&&&$$$&&&&&&&&&&&&&&&&&&&&&&&&&&&$x;++;;::;:::;X&&&X+x++;.:$&&$&&&&$&&&&$$$&$&&&&$&&&&;+xxxxxxX.
# x&&&&&&&&&&&&$&&&&&&&&&&&&&$$&&$&&$&&&&&&&&&&&&&X+;:;;;;+;;;+X&&&&X+;:.:X&&&$$$&&&&&&&&&&&&&&&&&&&&X::;++xxx.
# :xxxxxxx++++++xxx+++++++++++xxxx+++x;..........::.........................xx++++++++++++++++++xxxX$&;........

# Вы можете расположить сценарий своей игры в этом файле.

define config.mouse = { }
define config.mouse['default'] = [ ( "gui/hand.png", 15, 15) ]
define config.mouse['button'] = [ ( "gui/finger.png", 15, 15) ]

transform left_center:
    xalign 0.0
    yalign 0.5

transform right_center:
    xalign 1.0
    yalign 0.5

# Определение персонажей игры.
define m = Character('Мама', color="#c8ffc8", image="mom")
define s = Character('Старшая сестра', color="#c8ffc8", image="sister")

# Игра начинается здесь:
label start:

    scene bg room

    show mom normal at right

    m "Вы создали новую игру Ren'Py."

    show mom normal at left

    m smiling "Добавьте сюжет, изображения и музыку и отправьте её в мир!Добавьте сюжет, изображения и музыку и отправьте её в мир!"

    hide mom

    show sister normal at center

    s 'Тебя никто не любит'

    hide sister

    jump room

    return